{
  "science": [
    {
      "text": "Which type of rock forms in layers, is often found near water, and contains fossils?",
      "answers": ["Igneous", "Sedimentary", "Metamorphic", "Granite"],
      "correctIndex": 1,
      "explanation": "Sedimentary rocks form in layers (strata) as sediment is deposited, often in bodies of water, and may contain fossils of plants and animals that were buried in the sediment."
    },
    {
      "text": "Qual è l'elemento chimico più abbondante nell'universo?",
      "answers": ["Ossigeno", "Carbonio", "Idrogeno", "Elio"],
      "correctIndex": 2,
      "explanation": "L'idrogeno è l'elemento più abbondante nell'universo, costituendo circa il 75% della massa barionica."
    },
    {
      "text": "What is the chemical symbol for gold?",
      "answers": ["Ag", "Au", "Fe", "Pb"],
      "correctIndex": 1,
      "explanation": "The chemical symbol for gold is Au, which comes from the Latin word 'aurum'."
    },
    {
      "text": "Quale scienziato ha sviluppato la teoria della relatività?",
      "answers": ["Isaac Newton", "Galileo Galilei", "Albert Einstein", "Stephen Hawking"],
      "correctIndex": 2,
      "explanation": "Albert Einstein è noto per aver sviluppato la teoria della relatività, che ha rivoluzionato la nostra comprensione dello spazio, del tempo, della gravità e dell'universo."
    }
  ],
  "entertainment": [
    {
      "text": "Which actor played Iron Man in the Marvel Cinematic Universe?",
      "answers": ["Chris Evans", "Chris Hemsworth", "Robert Downey Jr.", "Mark Ruffalo"],
      "correctIndex": 2,
      "explanation": "Robert Downey Jr. played Tony Stark / Iron Man in the Marvel Cinematic Universe from 2008 to 2019."
    },
    {
      "text": "Chi è il regista del film 'La vita è bella'?",
      "answers": ["Federico Fellini", "Roberto Benigni", "Giuseppe Tornatore", "Paolo Sorrentino"],
      "correctIndex": 1,
      "explanation": "Roberto Benigni ha diretto e interpretato il film 'La vita è bella' nel 1997, vincendo tre premi Oscar."
    },
    {
      "text": "What is the name of Luke Skywalker's sister in Star Wars?",
      "answers": ["Leia Organa", "Padmé Amidala", "Rey", "Ahsoka Tano"],
      "correctIndex": 0,
      "explanation": "Luke Skywalker's sister is Leia Organa, later revealed to be Leia Skywalker."
    },
    {
      "text": "Quale famoso attore italiano ha recitato nel film 'Il buono, il brutto e il cattivo'?",
      "answers": ["Marcello Mastroianni", "Vittorio Gassman", "Alberto Sordi", "Clint Eastwood"],
      "correctIndex": 3,
      "explanation": "Anche se è americano, Clint Eastwood è diventato famoso in Italia recitando in 'Il buono, il brutto e il cattivo', diretto da Sergio Leone."
    }
  ],
  "sports": [
    {
      "text": "In which sport would you perform a slam dunk?",
      "answers": ["Football", "Basketball", "Tennis", "Golf"],
      "correctIndex": 1,
      "explanation": "A slam dunk is a basketball move in which a player jumps high and forcefully puts the ball through the hoop with one or both hands."
    },
    {
      "text": "In quale città si sono svolte le Olimpiadi del 2020 (tenutesi nel 2021)?",
      "answers": ["Pechino", "Parigi", "Tokyo", "Rio de Janeiro"],
      "correctIndex": 2,
      "explanation": "Le Olimpiadi del 2020 si sono svolte a Tokyo, Giappone, ma sono state posticipate al 2021 a causa della pandemia di COVID-19."
    },
     {
      "text": "How many players are on a baseball team?",
      "answers": ["9", "10", "11", "12"],
      "correctIndex": 0,
      "explanation": "A baseball team has 9 players."
    },
    {
      "text": "Qual è il nome del famoso pilota italiano di Formula 1 che ha corso per la Ferrari?",
      "answers": ["Valentino Rossi", "Giacomo Agostini", "Alberto Ascari", "Marco Simoncelli"],
      "correctIndex": 2,
      "explanation": "Alberto Ascari è stato un famoso pilota italiano che ha vinto due campionati mondiali di Formula 1 con la Ferrari."
    }
  ],
  "art": [
    {
      "text": "Who painted the Mona Lisa?",
      "answers": ["Vincent van Gogh", "Pablo Picasso", "Leonardo da Vinci", "Michelangelo"],
      "correctIndex": 2,
      "explanation": "The Mona Lisa was painted by Leonardo da Vinci between 1503 and 1519."
    },
    {
      "text": "Chi ha scolpito il David conservato nella Galleria dell'Accademia a Firenze?",
      "answers": ["Donatello", "Leonardo da Vinci", "Michelangelo", "Raffaello"],
      "correctIndex": 2,
      "explanation": "Il David è una scultura realizzata da Michelangelo Buonarroti tra il 1501 e il 1504."
    },
    {
      "text": "Which art movement is known for its dream-like and illogical imagery?",
      "answers": ["Impressionism", "Realism", "Surrealism", "Abstract Expressionism"],
      "correctIndex": 2,
      "explanation": "Surrealism is characterized by its dream-like, bizarre, and illogical imagery, aiming to unlock the creative potential of the unconscious mind."
    }
  ],
  "geography": [
    {
      "text": "Which is the largest ocean on Earth?",
      "answers": ["Atlantic Ocean", "Indian Ocean", "Arctic Ocean", "Pacific Ocean"],
      "correctIndex": 3,
      "explanation": "The Pacific Ocean is the largest and deepest ocean on Earth, covering more than 30% of the Earth's surface."
    },
    {
      "text": "Qual è la capitale dell'Australia?",
      "answers": ["Sydney", "Melbourne", "Canberra", "Perth"],
      "correctIndex": 2,
      "explanation": "Canberra è la capitale dell'Australia, non Sydney o Melbourne come molti credono erroneamente."
    },
    {
      "text": "What is the longest river in the world?",
      "answers": ["Amazon River", "Nile River", "Yangtze River", "Mississippi River"],
      "correctIndex": 1,
      "explanation": "The Nile River is traditionally considered the longest river in the world."
    },
    {
      "text": "Quale catena montuosa separa l'Europa dall'Asia?",
      "answers": ["Alpi", "Appennini", "Ande", "Urali"],
      "correctIndex": 3,
      "explanation": "I monti Urali segnano il confine convenzionale tra Europa e Asia."
    }
  ],
  "history": [
    {
      "text": "In which year did World War II end?",
      "answers": ["1943", "1945", "1947", "1950"],
      "correctIndex": 1,
      "explanation": "World War II ended in 1945 with the surrender of Germany in May and Japan in September."
    },
    {
      "text": "In che anno è caduto il Muro di Berlino?",
      "answers": ["1987", "1989", "1991", "1993"],
      "correctIndex": 1,
      "explanation": "Il Muro di Berlino è caduto il 9 novembre 1989, segnando la fine della divisione della Germania."
    },
    {
      "text": "Who was the first President of the United States?",
      "answers": ["Thomas Jefferson", "Abraham Lincoln", "George Washington", "John Adams"],
      "correctIndex": 2,
      "explanation": "George Washington was the first President of the United States, serving from 1789 to 1797."
    },
    {
      "text": "Quale imperatore romano ha legalizzato il cristianesimo nell'Impero Romano?",
      "answers": ["Nerone", "Augusto", "Costantino", "Giulio Cesare"],
      "correctIndex": 2,
      "explanation": "L'imperatore Costantino legalizzò il cristianesimo con l'Editto di Milano nel 313 d.C."
    }
  ]
}